In [3]:
import pandas as pd

movies = pd.read_pickle('../pandas/datasets/movies.p')
movies.shape
movies.head(2)
movies.columns

Index(['id', 'title', 'popularity', 'release_date'], dtype='object')

In [4]:
taglines = pd.read_pickle('../pandas/datasets/taglines.p')
taglines.shape
taglines.head(2)
taglines.columns

Index(['id', 'tagline'], dtype='object')

In [5]:
financials = pd.read_pickle('../pandas/datasets/financials.p')
financials.shape
financials.head(2)
financials.columns

Index(['id', 'budget', 'revenue'], dtype='object')

In [6]:
# Merge movies and financials with a left join
movies_financials = movies.merge(financials, on='id', how='left')

In [7]:
# Count the number of rows in the budget column that are missing
number_of_missing_fin = movies_financials['budget'].isnull().sum()

In [8]:
# Print the number of movies missing financials
print(number_of_missing_fin)

1574

In [13]:
toy_story = pd.DataFrame({
          'id': [10193, 863, 862],
          'title': ['Toy Story 3', 'Toy Story 2', 'Toy Story'],
          'popularity': [59995, 73575, 73640],
          'release_date': ['2010-06-16', '1999-10-30', '1995-10-30']
})

In [14]:
toy_story_tag = toy_story.merge(taglines, on='id', how='left')

In [15]:
# Print the rows and shape of toystory_tag
print(toy_story_tag)
print(toy_story_tag.shape)

      id        title  popularity release_date                   tagline
0  10193  Toy Story 3       59995   2010-06-16  No toy gets left behind.
1    863  Toy Story 2       73575   1999-10-30        The toys are back!
2    862    Toy Story       73640   1995-10-30                       NaN
(3, 5)

In [16]:
movies.head()

      id                 title  popularity release_date
0    257          Oliver Twist   20.415572   2005-09-23
1  14290  Better Luck Tomorrow    3.877036   2002-01-12
2  38365             Grown Ups   38.864027   2010-06-24
3   9672              Infamous    3.680896   2006-11-16
4  12819       Alpha and Omega   12.300789   2010-09-17

In [17]:
taglines.head()

       id                                         tagline
0   19995                     Enter the World of Pandora.
1     285  At the end of the world, the adventure begins.
2  206647                           A Plan No One Escapes
3   49026                                 The Legend Ends
4   49529            Lost in our world, found in another.

In [26]:
genres = pd.read_pickle('../pandas/datasets/movie_to_genres.p')
genres.shape
genres.head()

   movie_id            genre
0         5            Crime
1         5           Comedy
2        11  Science Fiction
3        11           Action
4        11        Adventure

In [20]:
movies.head()

      id                 title  popularity release_date
0    257          Oliver Twist   20.415572   2005-09-23
1  14290  Better Luck Tomorrow    3.877036   2002-01-12
2  38365             Grown Ups   38.864027   2010-06-24
3   9672              Infamous    3.680896   2006-11-16
4  12819       Alpha and Omega   12.300789   2010-09-17

In [29]:
action_movies = genres.loc[genres['genre'] == 'Action']

In [30]:
action_movies.shape

(1154, 2)

In [31]:
scifi_movies = genres.loc[genres['genre'] == 'Science Fiction']

In [32]:
scifi_movies.shape

(535, 2)

In [36]:
action_scifi = action_movies.merge(scifi_movies, on='movie_id', how='right', suffixes=('_act', '_sci'))

In [37]:
action_scifi.shape

(535, 3)

In [38]:
action_scifi.head()

   movie_id genre_act        genre_sci
0        11    Action  Science Fiction
1        18    Action  Science Fiction
2        19       NaN  Science Fiction
3        38       NaN  Science Fiction
4        62       NaN  Science Fiction

In [39]:
scifi_only = action_scifi[action_scifi['genre_act'].isnull()]

In [40]:
scifi_only.head()

   movie_id genre_act        genre_sci
2        19       NaN  Science Fiction
3        38       NaN  Science Fiction
4        62       NaN  Science Fiction
5        68       NaN  Science Fiction
6        74       NaN  Science Fiction

In [41]:
# Merge the movies and scifi_only tables with an inner join
movies_and_scifi_only = movies.merge(scifi_only, how='inner', left_on='id', right_on='movie_id')

In [42]:
movies_and_scifi_only.head()

,id,title,popularity,release_date,movie_id,genre_act,genre_sci
0,18841,The Lost Skeleton of Cadavra,1.680525,2001-09-12,18841,NaN,Science Fiction
1,26672,The Thief and the Cobbler,2.439184,1993-09-23,26672,NaN,Science Fiction
2,15301,Twilight Zone: The Movie,12.902975,1983-06-24,15301,NaN,Science Fiction
3,8452,The 6th Day,18.447479,2000-11-17,8452,NaN,Science Fiction
4,1649,Bill & Ted's Bogus Journey,11.349664,1991-07-19,1649,NaN,Science Fiction